# running in counter/src/
read_verilog -sv -formal counter.v
prep -top counter

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
